benchmarks/tsung/chat-1to1.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<!--
  xmppd load test: 1:1 messaging
  50 users connect over 30s, each sends 10 messages to a random peer.
  Uses STARTTLS + SASL PLAIN against morante.dev jail.
-->
<tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="200"/>
  </clients>

  <servers>
    <server host="127.0.0.1" port="5222" type="tcp"/>
  </servers>

  <load>
    <!-- Ramp up 50 users over 30 seconds -->
    <arrivalphase phase="1" duration="30" unit="second">
      <users interarrival="0.6" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option type="ts_jabber" name="domain" value="morante.dev"/>
    <option type="ts_jabber" name="username" value="user"/>
    <option type="ts_jabber" name="passwd" value="test1234"/>
    <option type="ts_jabber" name="userid_max" value="100"/>
    <option type="ts_jabber" name="global_number" value="100"/>
  </options>

  <sessions>
    <session probability="100" name="chat-1to1" type="ts_jabber">

      <!-- Connect and authenticate -->
      <request><jabber type="connect" ack="local"/></request>
      <thinktime value="1" random="false"/>
      <request><jabber type="auth_sasl" ack="local"/></request>
      <request><jabber type="connect" ack="local"/></request>
      <request><jabber type="auth_sasl_bind" ack="local"/></request>
      <request><jabber type="auth_sasl_session" ack="local"/></request>

      <!-- Send initial presence -->
      <request><jabber type="presence:initial" ack="no_ack"/></request>
      <thinktime value="2" random="false"/>

      <!-- Send 10 messages to random users -->
      <for from="1" to="10" var="i">
        <thinktime value="1" random="true"/>
        <transaction name="send_msg">
          <request>
            <jabber type="chat" ack="no_ack" size="64" destination="random"/>
          </request>
        </transaction>
      </for>

      <thinktime value="3" random="false"/>
      <request><jabber type="close" ack="no_ack"/></request>
    </session>
  </sessions>

</tsung>